#ВАРИАНТ 3

#Задание 1
s = [1, 2, 6, 4, 9]
summ = 0 
for i in range(len(s)):
    if i%2==0:#проверка на четность номера элемента 
       summ+=s[i] #сумма нечетных элементов
print(s, summ)

#Задание 2
s = [1, 2, 3, 4, 5, 6, 15, 16, 21]
for i in range(len(s)):
    if s[i] < 15: # Проверка эемента на то, меньше ли он 15
        s[i] = s[i]*2 # Замена элемента на удвоенный
print(s)
